Repository: zonemaster/zonemaster-cli
Catalog: share/*.po
Languages: sl, sv

source: Print version information and exit.
sv: Skriv ut versionsinformation och avsluta.

source: The minimum severity level to display. Must be one of CRITICAL, ERROR, WARNING, NOTICE, INFO or DEBUG.
sv: Den lägsta allvarlighetsgrad som skall skrivas ut. Måste vara en av CRITICAL, ERROR, WARNING, NOTICE, INFO eller DEBUG.

source: The locale to use for messages translation.
sv: Den locale som skall användas för utskrifter.

source: Flag indicating if output should be in JSON or not.
sv: Flagga som avgör om utskrift skall göras som JSON.

source: Flag indicating if output should be streaming JSON or not.
sv: Flagga som avgör om utskrift skall göras som en JSON-ström.

source: Deprecated. Flag indicating if JSON output should include the translated message of the tag or not.
sv: Flagga som avgör om JSON-utskrifter skall ska inkludera det översatta meddelandet till etiketten eller inte. (Flaggan är under utfasning och bör undvikas.)

source: Flag indicating if output should be translated to human language or dumped raw.
sv: Flagga som avgör om resultat skall skrivas ut i råformat.

source: Print timestamp on entries.
sv: Skriv ut tidsstämplar.

source: Print level on entries.
sv: Skriv ut allvarlighetsnivåer.

source: Print the name of the module on entries.
sv: Specificera vilken testmodul varje meddelande kommer från.

source: Print the name of the test case on entries.
sv: Specificera vilket testfall varje meddelande kommer från.

source: A name/ip string giving a nameserver for undelegated tests, or just a name which will be looked up for IP addresses. Can be given multiple times.
sv: Ett par av namn/IP som anger en namnserver att använda för odelegerade tester, eller bara ett namn som kan anges för att slå upp IP-adresser. Kan ges flera gånger.

source: Name of a root hints file to override the defaults.
sv: Namn på en fil med s.k. "root hints" som ersätter standardvärden.

source: Name of a file to save DNS data to after running tests.
sv: Namn på en fll att spara DNS-data i efter en körning.

source: Name of a file to restore DNS data from before running test.
sv: Namn på en fil att läsa in DNS-data från innan tester körs.

source: Flag to permit or deny queries being sent via IPv4. --ipv4 permits IPv4 traffic, --no-ipv4 forbids it.
sv: Flagga som tillåter eller förbjuder användning av IPv4. --ipv4 tillåter, --no-ipv4 förbjuder.

source: Flag to permit or deny queries being sent via IPv6. --ipv6 permits IPv6 traffic, --no-ipv6 forbids it.
sv: Flagga som tillåter eller förbjuder användning av IPv6. --ipv6 tillåter, --no-ipv6 förbjuder.

source: Instead of running a test, list all available tests.
sv: Istället för att köra tester, skriv ut en lista med alla tillgängliga tester.

source: Specify test to run. Should be either the name of a module, or the name of a module and the name of a method in that module separated by a "/" character (Example: "Basic/basic1"). The method specified must be one that takes a zone object as its single argument. This switch can be repeated.
sv: Specificera tester att köra. Skall vara antingen namnet på en testmodul, eller namnet på en modul och namnet på en testmetod i den modulen separerade med ett snedstreck (exempel: "Basic/basic1"). Den utpekade metoden måste vara en som tar enbart ett zon-objekt som argument. Den här flaggan kan anges flera gånger.

source: As soon as a message at this level or higher is logged, execution will stop. Must be one of CRITICAL, ERROR, WARNING, NOTICE, INFO or DEBUG.
sv: Avsluta testkörningen så snart ett meddelande med denna nivå eller högre registreras. Måste vara en av CRITICAL, ERROR, WARNING, NOTICE, INFO eller DEBUG.

source: Name of profile file to load. (DEFAULT)
sv: Namnet på en profile-fil att läsa in. (DEFAULT)

source: Strings with DS data on the form "keytag,algorithm,type,digest"
sv: En sträng med DS-data på formatet "keytag,algoritm,typ,digest".

source: Print a count of the number of messages at each level
sv: Skriv ut en summering av antalet registrerade meddelanden på varje nivå.

source: Boolean flag for activity indicator. Defaults to on if STDOUT is a tty, off if it is not. Disable with --no-progress.
sv: Flagga för om en aktivitets-indikator skall användas. Normalt på om STDOUT är en TTY, och av annars. Inaktivera med --no-progress.

source: Name of the character encoding used for command line arguments
sv: Namnet på den teckenkodning som används för kommandoradsargumenten.

source: At the end of a run, print a summary of the times (in milliseconds) the zone's name servers took to answer.
sv: Efter att körningen avslutats, skriv ut en summering av zonens namnservrars svarstider.

source: Deprecated (planned removal: v2024.1). Use --sourceaddr4 and/or --sourceaddr6. Source IP address used to send queries. Setting an IP address not correctly configured on a local network interface causes cryptic error messages.
sv: Flaggan är under utfasning (planerad radering: v2024.1). Använd --sourceaddr4 och/eller --sourceaddr6. Käll-IP-adress som används för att skicka DNS-förfrågan från. Att sätta en IP-adress som inte är korrekt inställd på ett lokalt nätverksgränssnitt ("network interface") leder till svårtydda felmeddelanden.

source: Source IPv4 address used to send queries. Setting an IPv4 address not correctly configured on a local network interface fails silently. Can not be combined with --sourceaddr.
sv: Käll-IPv4-adress som används för att skicka DNS-förfrågan från. Att sätta en IPv4-adress som inte är korrekt inställd på ett lokalt nätverksgränssnitt ("network interface") leder till fel utan felmeddelanden. Kan inte användas tillsammans med --sourceaddr.

source: Source IPv6 address used to send queries. Setting an IPv6 address not correctly configured on a local network interface fails silently. Can not be combined with --sourceaddr.
sv: Käll-IPv6-adress som används för att skicka DNS-förfrågan från. Att sätta en IPv6-adress som inte är korrekt inställd på ett lokalt nätverksgränssnitt ("network interface") leder till fel utan felmeddelanden. Kan inte användas tillsammans med --sourceaddr.

source: Print elapsed time (in seconds) at end of run.
sv: Skriv ut åtgången tid (i sekunder) när körningen har avslutats.

source: Warning: setting locale category LC_MESSAGES to %s failed (is it installed on this system?).
sv: Varning: misslyckades med att sätta locale kategori LC_MESSAGES till '%s' (finns den installerad på det här systemet?).

source: Warning: setting locale category LC_CTYPE to %s failed (is it installed on this system?).
sv: Varning: misslyckades med att sätta locale kategori LC_CTYPE till '%s' (finns den installerad på det här systemet?).

source: Error: --sourceaddr can't be combined with --sourceaddr4 or --sourceaddr6.
sv: Fel: --sourceaddr kan inte användas tillsammans med --sourceaddr4 eller --sourceaddr6.

source: Warning: --sourceaddr is deprecated (planned removal: v2024.1). Use --sourceaddr4 and/or --sourceaddr6 instead.
sv: Varning: --sourceaddr är under utfasning (plannerat borttag: v2024.1). Använd --sourceaddr4 och/eller --sourceaddr6 instället.

source: Error: --json-stream and --no-json can't be used together.
sv: Fel: --json-stream och --no-json kan inte användas tillsammans.

source: Warning: --json-translate has no effect without either --json or --json-stream.
sl: Opozorilo: --json-translate nima učinka brez --json ali --json-stream.
sv: Varning: --json-translate är verkningslös utan samtidig --json eller --json-stream.

source: Warning: deprecated --json-translate, use --no-raw instead.
sl: Opozorilo: --json-translate je zastarelo, uporabi --no-raw.
sv: Varning: --json-translate är under utfasning. Använd --no-raw instället.

source: Warning: deprecated --no-json-translate, use --raw instead.
sl: Opozorilo: --no-json-translate je zastarelo, uporabi --raw.
sv: Varning: --no-json-translate är under utfasning. Använd --raw instället.

source: Loading profile from {path}.
sl: Nalagam profil iz {path}.
sv: Laddar profil från {path}.

source: Failed to recognize stop level '
sv: Kände inte igen avslutsnivån '

source: --level must be one of CRITICAL, ERROR, WARNING, NOTICE, INFO, DEBUG, DEBUG2 or DEBUG3.
sv: --level måste vara en av CRITICAL, ERROR, WARNING, NOTICE, INFO, DEBUG, DEBUG2 eller DEBUG3.

source: Seconds
sl: Sekund
sv: Sekund

source: Level
sl: Stopnja
sv: Nivå

source: Module
sl: Modul
sv: Modul

source: Testcase
sl: Vrsta testa
sv: Testfall

source: Message
sl: Sporočilo
sv: Meddelande

source: Only one domain can be given for testing. Did you forget to prepend an option with '--<OPTION>'?
sv: Endast ett domännamn kan anges för testning. Missade du att sätta '--<OPTION>' före en optionsparameter?

source: Must give the name of a domain to test.
sv: Måste ange namnet på en domän att testa.

source: The domain name contains consecutive dots.
sv: Domännamnet innehåller flera punkter i följd.

source: Looks OK.
sl: Videti je v redu.
sv: Ser OK ut.

source: Level Number of log entries
sl: Stopnja Število dnevniških vnosov
sv: Nivå Antal loggmeddelanden

source: %8s %5d entries.
sl: %8s %5d vnosov.
sv: %8s %5d meddelanden.

source: --ns must be a name or a name/ip pair.
sl: --ns mora biti ime ali ime/IP par.
sv: --ns måste vara ett namn eller namn/ip i det formatet."

source: The name of the nameserver '{nsname}' contains consecutive dots.
sv: Namnet på namnserver "{nsname}" innehåller flera punkter i följd.

source: Warning: Zonemaster::LDNS not compiled with IDN support, cannot handle non-ASCII names correctly.
sv: Varning: Zonemaster::LDNS är inte kompilerad med IDNA-stöd, så enbart ASCII-namn kan hanteras.

source: NOTICE
sl: OBVESTILO
sv: NOTIS

source: WARNING
sl: OPOZORILO
sv: VARNING

source: ERROR
sl: NAPAKA
sv: FEL

source: CRITICAL
sl: KRITIČNO
sv: KRITISKT

source: Warning: setting locale category LC_MESSAGES to {locale} failed -- is it installed on this system?
sl: Opozorilo: nastavitev področne kategorije LC_MESSAGES na {locale} ni uspela -- ali je nameščena na tem sistemu?

source: Warning: setting locale category LC_CTYPE to {locale} failed -- is it installed on this system?
sl: Opozorilo: nastavitev področne kategorije LC_CTYPE na {locale} ni uspela -- ali je nameščena na tem sistemu?

source: Warning: deprecated --encoding, simply remove it from your usage.
sl: Opozorilo: zastarel "--encoding".

source: Error: --json-stream and --no-json cannot be used together.
sl: Napaka: --json-stream in --no-json ne moreta biti uporabljena skupaj.

source: Error: invalid value for --sourceaddr4: {reason}
sl: Napaka: napačna vrednost za --sourceaddr4: {reason}

source: Error: invalid value for --sourceaddr6: {reason}
sl: Napaka: napačna vrednost za --sourceaddr6: {reason}

source: Error: Invalid input '{cli_arg}' in --test. There must be at most one slash ('/') character.
sl: Napaka: napačen vnos '{cli_arg}' v --test. Prisoten mora biti vsaj en ('/') znak.

source: Error: Unrecognized test case '{testcase}' in --test. Use --list-tests for a list of valid choices.
sl: Napaka: Neprepoznana vrsta testa '{testcase}' v --test. Uporabite --list-tests za seznam možnosti.

source: Error: Unrecognized test module '{module}' in --test. Use --list-tests for a list of valid choices.
sl: Napaka: Neprepoznana vrsta modula '{module}' v --test. Uporabite --list-tests za seznam možnosti.

source: Error: Invalid input '{cli_arg}' in --test.
sl: Napaka: Nepravilen vnos '{cli_arg}' v --test.

source: Notice: Engine does not have test case '{testcase}' enabled in the profile. Forcing...
sl: Obvestilo: Program nima omogočenega '{testcase}' v profilu. Nadaljujem na silo...

source: Failed to recognize stop level '{level}'.
sl: Ni mogoče prepoznati stopnje resnosti '{level}', ki povzroči ustavitev '.

source: --level must be one of CRITICAL, ERROR, WARNING, NOTICE, INFO, DEBUG, DEBUG2 or DEBUG3.
sl: --level mora biti eden izmed KRITIČNO, NAPAKA, OPOZORILO, OBVESTILO, INFO, DEBUG, DEBUG2 ali DEBUG3.

source: Only one domain can be given for testing. Did you forget to prepend an option with '--<OPTION>'?
sl: Lahko se preverja le ena domena. Ste pozabili dodati `--<OPTION>` ?

source: Must give the name of a domain to test.
sl: Vnesite ime domene za preverjanje.

source: Error loading hints file: {message}
sl: Napaka pri nalaganju datoteke z namigi: {message}

source: --ds ds data must be in the form "keytag,algorithm,type,digest". E.g. space is not permitted anywhere in the string.
sl: --ds ds podatki morajo biti v formatu "keytag,algorithm,type,digest". presledki niso dovoljeni v nizu.
